# Изчисляване на периметър и лице на трапец и успоредник

# Трапец
a = float(input("Въведете дължината на основата а: "))
b = float(input("Въведете дължината на основата b: "))
h = float(input("Въведете дължината на височината h: "))
c = float(input("Въведете дължината на страната с: "))
p = a + b + c + h
s = ((a + b) * h) / 2

# Успоредник
d = float(input("Въведете дължината на страната a: "))
e = float(input("Въведете дължината на страната b: "))
j = str(input("Посочете с коя височина ще изчислявате (ha/hb): "))
if j == "ha":
    f = float(input("Въведете дължината на височината h: "))
    g = a * h
else:
    f = float(input("Въведете дължината на височината h: "))
    g = b * h
w = 2 * d + 2 * e

print(f"Периметъра на трапеца е: {p}")
print(f"Лицето на трапеца е: {s}")
print(f"Периметъра на успоредника е: {w}")
print(f"Лицето на успоредника е: {g}")
